{"data":{"site":{"siteMetadata":{"title":"Kirankumar Ambati","author":"Kirankumar Ambati"}},"markdownRemark":{"id":"8cb50e67-f5b5-519e-aed5-66a331e8ae54","excerpt":"Node has become a part of most of our coding lives. But if we are working on latest technologies like React and at the same time working on your legacy code…","html":"<p>Node has become a part of most of our coding lives. But if we are working on latest technologies like React and at the same time working on your legacy code, you might have noticed that you have switch between two versions of Node. For instance, I was working with node v6.10.2 for my company project and node v10.15.0 for my personal learnings. I used to uninstall and install those versions based on my requirements until I found NVM.</p>\n<h2>NVM - Node Version Manager</h2>\n<p>NVM stands for “Node Version Manager”. NVM helps us to handle multiple versions of node very easily by giving us the ability to switch between them based on our requirement.</p>\n<h4>Let us look at the setup</h4>\n<ul>\n<li>\n<p><strong>Installing nvm</strong></p>\n<p>For installing <em>nvm</em>, head over <a href=\"https://github.com/coreybutler/nvm-windows/releases\">here</a> and download the latest stable nvm setup file (<code class=\"language-text\">nvm-setup.zip</code>). At the time of writing this article, the stable version is <strong><em>1.1.7</em></strong></p>\n<p>Download the .zip file and extract .exe from it and proceed with installation.</p>\n</li>\n<li>\n<p><strong>Installing nodejs</strong></p>\n<p>We have done with the installation of nvm. Now we have to install our required node versions. For example, if we need latest node version along with v6.10.2, we have to do:</p>\n<p>For istalling latest nodejs version, run </p>\n<p><strong><code class=\"language-text\">$ nvm install latest</code></strong></p>\n<p>For istalling specific version of nodejs, run </p>\n<p><strong><code class=\"language-text\">$ nvm install 6.10.2</code></strong></p>\n<p>restart your Command Prompt.</p>\n</li>\n<li>\n<p>Usage:</p>\n<p>Now we have both the versions of node installed on to our system. To verify which versions are present, run\n<strong><code class=\"language-text\">$ nvm list</code></strong></p>\n<p>which lists down all your versions oresent on your syaytem.</p>\n<p>To switch between versions, just run <strong><code class=\"language-text\">$ nvm use &lt;node_version_you_want_to_use&gt;</code></strong>. For eg,</p>\n<p><strong><code class=\"language-text\">$ nvm use 10.15.0</code></strong></p>\n<p>We are now switched to Node v10.15.0. To verify, try running</p>\n<p><strong><code class=\"language-text\">$ node -v</code></strong></p>\n<p>that should return you the version we have choosen.</p>\n</li>\n<li>\n<p>That’s all folks ! Now we are good to keep rocking with our coding.</p>\n</li>\n</ul>\n<p><strong>NOTE:</strong> One important thing to remember when we are using nvm, the global space of each node version is different. i.e., if you have some node modules installed globally for one version of node, they won’t be accessible to other versions. You have to install them seperately on those versions too.</p>","frontmatter":{"title":"NVM To The Rescue","date":"February 26, 2019","description":null}}},"pageContext":{"slug":"/nvm-setup/","previous":{"fields":{"slug":"/inception-post/"},"frontmatter":{"title":"Inception"}},"next":null}}